{
  "main": {
    "name":"Dan Shrout",
    "description":"Full Stack Software Developer specializing in React",
    "bio": "I'm a Software Developer with over 5 years of experience with a passion for technology. Computer programming has expanded my brain and made me a great problem solver. Let's connect!",
    "image":"profilepic.jpg",
    "contactmessage":"Contact form is under construction. Please use my contact info to contact me!",
    "email": "danshrout1@gmail.com",
    "phone": "562-846-8831",
    "github":"https://github.com/Schraut",
    "address":{
      "street":"",
      "city":"Long Beach",
      "state":"California"
    },
    "website": "http://www.timbakerdev.com",
    "social":[
      {
        "name":"twitter",
        "url":"http://twitter.com/danshrout",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/dan-shrout/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/Schraut",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"Actualize Coding Bootcamp",
        "degree":"Full Stack Web Development",
        "graduated":"February 2018",
        "description":"I took the intensive, 3-month Actualize bootcamp, where I learned Ruby, Rails, JavaScript, VueJS, and more. But most importantly, I learned how to think as a software engineer and gained the ability to tackle any new technology."
      },
      {
        "school":"Zero To Mastery Academy",
        "degree":"Computer Software Engineering",
        "graduated":"January 2020 - Present",
        "description":"Learning everything computer science related including: full stack react development, computer science, web development, algorithms, datastructures, and much more."
      }
    ],
    "work":[
      {
        "company":"Team Hack",
        "title":"React Developer",
        "years":"May 2021 - Present",
        "description":"Open source React project where we are building a clone of Robinhood. Initialized and configured app with create-react-app which allowed my team and I to begin adding features. Pair programmed to install and configure TypeScript with linting to keep code consistent with all developers. Performed code reviews, approved pull requests, and merged to the main branch after passing all tests. Built header component with react-router-dom to handle navigation between all pages of the app."
      },
      {
        "company":"IDMRTV",
        "title":"Android Developer",
        "years":"September 2019 - April 2020",
        "description":"Redesigned entire frontend of mobile car dealership marketing tool using Android Studio, Java, XML, and Material Design, resulting in a modern UI and professional appearance. Designed and built all necessary files for UI elements to fit consistently across all screen sizes of Android phones using Java and XML which solved the previous issue of missing elements on smaller devices. Installed icons with a name specific to its action using Java, Android, XML, and Material Design, making it self explanatory to the users."
      },
      {
        "company":"Staffed",
        "title":"Cofounder, Web & Android Engineer",
        "years":"November 2018 - September 2019",
        "description":"Collaborated with the team and created a mockup of our app, defined user flowchart, navigation structure, and architecture of database using Adobe XD. Pair programmed with the team to design and build the app database using Firebase Firestore which allowed iOS, Web and Android to save all data in one place. Solely created Android app using Android Studio, Java, and XML to begin adding features. Created features for users to create an account, sign in, and sign out with Java, Firebase Auth, and XML."
      },
      {
        "company":"Freelancing",
        "title":"Wordpress Developer",
        "years":"July 2019 - August 2019",
        "description":"Setup hosting and domain name using godaddy.com using the domain name chosen by my client. Installed WordPress theme and formatted it to hold all information about the art gallery. Installed plugin for photo gallery that the client could add, edit, and or delete photos whenever needed."
      },
      {
        "company":"Freelancing",
        "title":"Wordpress Developer",
        "years":"February 2019 - March 2019",
        "description":"Created WordPress site and installed theme of the clients choice to display company information and the inventory to be sold. Installed photo gallery plugin and set it up to where the client could add, edit and or delete photos of inventory whenever needed. Created separate pages for each individual category of inventory which allowed potential buyers to navigate throughout the site with ease."
      },
      {
        "company":"Actualize",
        "title":"Ruby on Rails Developer",
        "years":"November 2018 - September 2019",
        "description":"Added search bar to Actualize CRM to assist admin searching for applicants using Ruby on Rails, Javascript, Vue.js, and CSS that improved lookup speed by 10%. Pair programmed to integrate Twilio API using Ruby on Rails, Javascript, and Vue.js that saved company time and money by avoiding use of a cell phone for sending text and voice messages. Pair programmed to convert the company website into a single page application with Ruby on Rails, Vue.js, Javascript, and CSS which improved page loading speed by 20%."
      },
      {
        "company":"Freelancing",
        "title":"Web Developer",
        "years":"March 2017 - June 2017",
        "description":"Converted website into a single page application using HTML, CSS, jQuery, and Javascript resulting in a modern and professional UI making it easy to navigate for any user."
      }
    ],
    "skills":[
      {
        "name":"Javascript",
        "level":"90%"
      },
      {
        "name":"Reactjs",
        "level":"80%"
      },
      {
        "name":"Node.js",
        "level":"75%"
      },
      {
        "name":"Redux",
        "level":"90%"
      },
      {
        "name":"PostgreSQL",
        "level":"90%"
      },
      {
        "name":"Ruby on rails",
        "level":"70%"
      },
      {
        "name":"JAVA",
        "level":"70%"
      },
      {
        "name":"HTML",
        "level":"100%"
      },
      {
        "name":"CSS",
        "level":"100%"
      },
      {
        "name":"Firebase",
        "level":"70%"
      },
      {
        "name":"SASS",
        "level":"70%"
      },
      {
        "name":"Git",
        "level":"90%"
      },
      {
        "name":"Android",
        "level":"70%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"New Threads Clothing",
        "category":"An E-Commerce site built with React, Node.js and Redux",
        "image":"new-threads-clothing.jpg",
        "url":"https://new-threads-clothing.herokuapp.com/"
      },
      {
        "title":"Monsters",
        "category":"A simple react app that displays cartoons of friendly monsters with their names and emails",
        "image":"monsters.jpg",
        "url":"https://schraut.github.io/monsters/"
      },
      {
        "title":"Food App",
        "category":"Save your favorite restaurants and recipes built with Ruby on Rails and Vue.js",
        "image":"food_app.jpg",
        "url":"https://blooming-bastion-17680.herokuapp.com/"
      },
      {
        "title":"To Do List",
        "category":"To do list built with React Native",
        "image":"to-do-list.jpg",
        "url":"https://expo.dev/@danshrout/to-do-list"
      }
    ]
  }
}
